#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.lb-http.google_compute_global_address.default[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/addresses/web-lb-address]
module.lb-http.google_compute_managed_ssl_certificate.default[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/sslCertificates/web-lb-cert]
google_secret_manager_secret.supabase_port: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/supabase_port]
google_service_account.cloud_run_service_account: Refreshing state... [id=projects/coastal-fiber-430001-s0/serviceAccounts/cloud-run-service-account@coastal-fiber-430001-s0.iam.gserviceaccount.com]
google_secret_manager_secret.supabase_host: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/supabase_host]
google_secret_manager_secret.auth0_logout_url: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_logout_url]
google_secret_manager_secret.auth0_return_to_url: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_return_to_url]
google_secret_manager_secret.auth0_session_secret: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_session_secret]
google_secret_manager_secret.auth0_callback_url: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_callback_url]
module.cloud-dns.google_dns_managed_zone.public[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/managedZones/share-cart-com]
google_secret_manager_secret.supabase_user: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/supabase_user]
google_artifact_registry_repository.api-repo: Refreshing state... [id=projects/coastal-fiber-430001-s0/locations/asia-northeast1/repositories/api-repo]
google_secret_manager_secret.auth0_client_id: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_client_id]
google_secret_manager_secret.auth0_client_secret: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_client_secret]
google_secret_manager_secret.auth0_domain: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_domain]
google_secret_manager_secret.auth0_audience: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/auth0_audience]
google_artifact_registry_repository.web-repo: Refreshing state... [id=projects/coastal-fiber-430001-s0/locations/asia-northeast1/repositories/web-repo]
google_secret_manager_secret.supabase_db_dev: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/supabase_db_dev]
google_secret_manager_secret.supabase_password: Refreshing state... [id=projects/coastal-fiber-430001-s0/secrets/supabase_password]
google_project_iam_member.cloud_run_service_account_iam["roles/secretmanager.secretAccessor"]: Refreshing state... [id=coastal-fiber-430001-s0/roles/secretmanager.secretAccessor/serviceAccount:cloud-run-service-account@coastal-fiber-430001-s0.iam.gserviceaccount.com]
module.lb-http.google_compute_url_map.https_redirect[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/urlMaps/web-lb-https-redirect]
module.cloud-dns.google_dns_record_set.cloud-static-records["/A"]: Refreshing state... [id=projects/coastal-fiber-430001-s0/managedZones/share-cart-com/rrsets/share-cart.com./A]
google_cloud_run_v2_service.api: Refreshing state... [id=projects/coastal-fiber-430001-s0/locations/asia-northeast1/services/api]
google_cloud_run_service_iam_member.api-public-access: Refreshing state... [id=v1/projects/coastal-fiber-430001-s0/locations/asia-northeast1/services/api/roles/run.invoker/allUsers]
google_cloud_run_v2_service.web: Refreshing state... [id=projects/coastal-fiber-430001-s0/locations/asia-northeast1/services/web]
google_cloud_run_service_iam_member.web-public-access: Refreshing state... [id=v1/projects/coastal-fiber-430001-s0/locations/asia-northeast1/services/web/roles/run.invoker/allUsers]
google_compute_region_network_endpoint_group.web_neg: Refreshing state... [id=projects/coastal-fiber-430001-s0/regions/asia-northeast1/networkEndpointGroups/web-neg]
module.lb-http.google_compute_backend_service.default["default"]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/backendServices/web-lb-backend-default]
module.lb-http.google_compute_url_map.default[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/urlMaps/web-lb-url-map]
module.lb-http.google_compute_target_http_proxy.default[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/targetHttpProxies/web-lb-http-proxy]
module.lb-http.google_compute_target_https_proxy.default[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/targetHttpsProxies/web-lb-https-proxy]
module.lb-http.google_compute_global_forwarding_rule.https[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/forwardingRules/web-lb-https]
module.lb-http.google_compute_global_forwarding_rule.http[0]: Refreshing state... [id=projects/coastal-fiber-430001-s0/global/forwardingRules/web-lb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
      - client                  = "gcloud" -> null
      - client_version          = "495.0.0" -> null
        id                      = "projects/coastal-fiber-430001-s0/locations/asia-northeast1/services/api"
        name                    = "api"
        # (28 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "d3e2aeb7a16a9a60c22ec543da296f62328aa4eb" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (8 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/coastal-fiber-430001-s0/api-repo/api:d3e2aeb7a16a9a60c22ec543da296f62328aa4eb" -> "asia-northeast1-docker.pkg.dev/coastal-fiber-430001-s0/api-repo/api:latest"
              - name        = "api-1" -> null
                # (4 unchanged attributes hidden)

              ~ env {
                  ~ name  = "PROJECT_ID" -> "POSTGRES_USER"
                  - value = "coastal-fiber-430001-s0" -> null

                  + value_source {
                      + secret_key_ref {
                          + secret  = "supabase_user"
                          + version = "latest"
                        }
                    }
                }
              ~ env {
                  ~ name  = "POSTGRES_USER" -> "POSTGRES_PASSWORD"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "supabase_user" -> "supabase_password"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "POSTGRES_PASSWORD" -> "POSTGRES_DB"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "supabase_password" -> "supabase_db_dev"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "POSTGRES_DB" -> "POSTGRES_HOST"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "supabase_db_dev" -> "supabase_host"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "POSTGRES_HOST" -> "POSTGRES_PORT"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "supabase_host" -> "supabase_port"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "POSTGRES_PORT" -> "AUTH0_DOMAIN"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "supabase_port" -> "auth0_domain"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "AUTH0_DOMAIN" -> "AUTH0_AUDIENCE"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "auth0_domain" -> "auth0_audience"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "AUTH0_AUDIENCE" -> "PROJECT_ID"
                  + value = "coastal-fiber-430001-s0"

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_audience" -> null
                          - version = "latest" -> null
                        }
                    }
                }

              ~ resources {
                  ~ limits            = {
                      ~ "cpu"    = "2000m" -> "2"
                        # (1 unchanged element hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.web will be updated in-place
  ~ resource "google_cloud_run_v2_service" "web" {
      - client                  = "gcloud" -> null
      - client_version          = "495.0.0" -> null
        id                      = "projects/coastal-fiber-430001-s0/locations/asia-northeast1/services/web"
        name                    = "web"
        # (28 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "d3e2aeb7a16a9a60c22ec543da296f62328aa4eb" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (8 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/coastal-fiber-430001-s0/web-repo/web:d3e2aeb7a16a9a60c22ec543da296f62328aa4eb" -> "asia-northeast1-docker.pkg.dev/coastal-fiber-430001-s0/web-repo/web:latest"
              - name        = "web-1" -> null
                # (4 unchanged attributes hidden)

              ~ env {
                  ~ name  = "API_HOST" -> "AUTH0_CLIENT_ID"
                  - value = "https://api-i5n5vnecrq-an.a.run.app" -> null

                  + value_source {
                      + secret_key_ref {
                          + secret  = "auth0_client_id"
                          + version = "latest"
                        }
                    }
                }
              ~ env {
                  ~ name  = "SESSION_SECRET" -> "AUTH0_CLIENT_SECRET"
                    # (1 unchanged attribute hidden)

                  ~ value_source {
                      ~ secret_key_ref {
                          ~ secret  = "auth0_session_secret" -> "auth0_client_secret"
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
              ~ env {
                  ~ name  = "AUTH0_CALLBACK_URL" -> "API_HOST"
                  + value = "https://api-i5n5vnecrq-an.a.run.app"

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_callback_url" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              - env {
                  - name  = "AUTH0_CLIENT_ID" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_client_id" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              - env {
                  - name  = "AUTH0_CLIENT_SECRET" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_client_secret" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              - env {
                  - name  = "AUTH0_DOMAIN" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_domain" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              - env {
                  - name  = "AUTH0_LOGOUT_URL" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_logout_url" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              - env {
                  - name  = "AUTH0_AUDIENCE" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_audience" -> null
                          - version = "latest" -> null
                        }
                    }
                }
              - env {
                  - name  = "AUTH0_RETURN_TO_URL" -> null
                    # (1 unchanged attribute hidden)

                  - value_source {
                      - secret_key_ref {
                          - secret  = "auth0_return_to_url" -> null
                          - version = "latest" -> null
                        }
                    }
                }

              ~ resources {
                  ~ limits            = {
                      ~ "cpu"    = "2000m" -> "2"
                        # (1 unchanged element hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret.auth0_base_url will be created
  + resource "google_secret_manager_secret" "auth0_base_url" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "service" = "auth0"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "service" = "auth0"
        }
      + name                  = (known after apply)
      + project               = "coastal-fiber-430001-s0"
      + secret_id             = "auth0_base_url"
      + terraform_labels      = {
          + "service" = "auth0"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.auth0_callback_url will be destroyed
  # (because google_secret_manager_secret.auth0_callback_url is not in configuration)
  - resource "google_secret_manager_secret" "auth0_callback_url" {
      - annotations           = {} -> null
      - create_time           = "2024-08-17T08:57:16.596722Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {
          - "service" = "auth0"
        } -> null
      - id                    = "projects/coastal-fiber-430001-s0/secrets/auth0_callback_url" -> null
      - labels                = {
          - "service" = "auth0"
        } -> null
      - name                  = "projects/509846375238/secrets/auth0_callback_url" -> null
      - project               = "coastal-fiber-430001-s0" -> null
      - secret_id             = "auth0_callback_url" -> null
      - terraform_labels      = {
          - "service" = "auth0"
        } -> null
      - version_aliases       = {} -> null
        # (2 unchanged attributes hidden)

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.auth0_issuer_base_url will be created
  + resource "google_secret_manager_secret" "auth0_issuer_base_url" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "service" = "auth0"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "service" = "auth0"
        }
      + name                  = (known after apply)
      + project               = "coastal-fiber-430001-s0"
      + secret_id             = "auth0_issuer_base_url"
      + terraform_labels      = {
          + "service" = "auth0"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.auth0_logout_url will be destroyed
  # (because google_secret_manager_secret.auth0_logout_url is not in configuration)
  - resource "google_secret_manager_secret" "auth0_logout_url" {
      - annotations           = {} -> null
      - create_time           = "2024-08-17T08:57:16.803147Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {
          - "service" = "auth0"
        } -> null
      - id                    = "projects/coastal-fiber-430001-s0/secrets/auth0_logout_url" -> null
      - labels                = {
          - "service" = "auth0"
        } -> null
      - name                  = "projects/509846375238/secrets/auth0_logout_url" -> null
      - project               = "coastal-fiber-430001-s0" -> null
      - secret_id             = "auth0_logout_url" -> null
      - terraform_labels      = {
          - "service" = "auth0"
        } -> null
      - version_aliases       = {} -> null
        # (2 unchanged attributes hidden)

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.auth0_return_to_url will be destroyed
  # (because google_secret_manager_secret.auth0_return_to_url is not in configuration)
  - resource "google_secret_manager_secret" "auth0_return_to_url" {
      - annotations           = {} -> null
      - create_time           = "2024-08-17T08:57:16.608365Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {
          - "service" = "auth0"
        } -> null
      - id                    = "projects/coastal-fiber-430001-s0/secrets/auth0_return_to_url" -> null
      - labels                = {
          - "service" = "auth0"
        } -> null
      - name                  = "projects/509846375238/secrets/auth0_return_to_url" -> null
      - project               = "coastal-fiber-430001-s0" -> null
      - secret_id             = "auth0_return_to_url" -> null
      - terraform_labels      = {
          - "service" = "auth0"
        } -> null
      - version_aliases       = {} -> null
        # (2 unchanged attributes hidden)

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.auth0_secret will be created
  + resource "google_secret_manager_secret" "auth0_secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "service" = "auth0"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "service" = "auth0"
        }
      + name                  = (known after apply)
      + project               = "coastal-fiber-430001-s0"
      + secret_id             = "auth0_secret"
      + terraform_labels      = {
          + "service" = "auth0"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.auth0_session_secret will be destroyed
  # (because google_secret_manager_secret.auth0_session_secret is not in configuration)
  - resource "google_secret_manager_secret" "auth0_session_secret" {
      - annotations           = {} -> null
      - create_time           = "2024-08-17T08:57:16.792625Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {
          - "service" = "auth0"
        } -> null
      - id                    = "projects/coastal-fiber-430001-s0/secrets/auth0_session_secret" -> null
      - labels                = {
          - "service" = "auth0"
        } -> null
      - name                  = "projects/509846375238/secrets/auth0_session_secret" -> null
      - project               = "coastal-fiber-430001-s0" -> null
      - secret_id             = "auth0_session_secret" -> null
      - terraform_labels      = {
          - "service" = "auth0"
        } -> null
      - version_aliases       = {} -> null
        # (2 unchanged attributes hidden)

      - replication {
          - auto {
            }
        }
    }

Plan: 3 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Mkamono, Action: `pull_request`, Working Directory: `infra/terraform/remote`, Workflow: `.github/workflows/terraform-plan.yaml`*